#define _CRT_SECURE_NO_WARNINGS 1
//#include<stdio.h>
//int main()
//{
	//int a = -1;
	////>> -- 右移操作符-->1.算术右移（右边丢弃，左边补原符号位）  2.逻辑右移（右边丢弃，左边补0）
	//// 整数的二进制表示有:源码，反码，补码
	////存储到内存的是补码
	////10000000000000000000000000000001 -原码
	////11111111111111111111111111111110 -反码 
	////11111111111111111111111111111111 -补码
	//int b = a >> 1;
	//printf("%d ", b);
	//int a = 5;
	//int b = a << 1;
	//printf("%d ", b);

	//不适用第三变量，将两个数进行交换
	//int a = 5;
	//int b = 9;
	//a = a ^ b;
	//b = a ^ b;
	//	a = a ^ b;

	//a = a + b;//栈溢出
	//b = a - b;
	//a = a - b;
//	printf("a=%d b=%d\n", a,b);
//	return 0;
//}

//#include<stdio.h>
//#include<math.h>
//int main()
//{
	//求一个数中二进制中的1的个数
	//int input = 0;
	//int i = 0;
	//int count = 0;
	//printf("请输入一个数:");
	//scanf("%d", &input);
	//for (i = 0; i < 32; i++)
	//{
	//	if (1 == ((input >> i) & 1))
	//	{
	//		count++;
	//	}
	//}
	//printf("count=%d", count);

	//int a = 10;
	//printf("a=%d\n", a);
	//int* p = &a;
	//*p = 30;
	//printf("a=%d\n", *p);

	//~按（二进制）位取反
	//int a = 0;//000000000000000000000000原码
	//		  //111111111111111111111111补码
	//		  //111111111111111111111110反码
	//		  //100000000000000000000001原码
	//printf("%d\n", ~a);

	//int a = 11;//00000000000000000000000000001011原码
	//		   //11111111111111111111111111110100补码
	//		   //11111111111111111111111111110101反码
	//		   //10000000000000000000000000001010原码
	//printf("%d\n", ~a);

	//int a = 11;       //00000000000000000000000000001011
	//                  //00000000000000000000000000000100
	//a = a | (1 << 2); //00000000000000000000000000001111
	//printf("%d\n", a);//
	//a = a & (~(1 << 2));//00000000000000000000000000001111
	//                    //00000000000000000000000000000100                            
	//printf("%d\n", a);  //00000000000000000000000000001011

	//int a = 5;
	//printf("%d\n", a++);//5
	//printf("%d\n", a++);//6

	//强制类型转换
	//int a = (int)3.14;
	//printf("%d ",a);

	//0011
	//0101
	//int i = 0;
//	int j = 0;
//	int n = 0;
//	printf("请输入:>");
//	scanf("%d", &n);
//	for (i = 1; i <= n; i++)
//	{
//		for (j = 2; j <=sqrt(i); j++)
//		{	
//			if (i % j == 0)
//			{
//				break;
//			}
//		}
//		/*if (j == i)
//		{
//			printf("%d ", i);
//		}*/
//		if (j > sqrt(i))
//		{
//			printf("%d ", i);
//		}
//	}
//	return 0;           
//	                    
//}          

